docs(security): security analysis documentation
